<a href="https://colab.research.google.com/github/bomnism/DA/blob/main/da04_DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
# 필요한 모듈 import 
import pandas as pd        # DataFrame, Series
import seaborn as sns    # load_dataset() 함수를 사용하기 위해서

# tips dataset

In [4]:
# seaborn 패키지의 tips 예제 데이터 셋 모드 
tips = sns.load_dataset('tips')

In [5]:
type(tips)

pandas.core.frame.DataFrame

In [6]:
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [7]:
# DF의 shape
tips.shape

(244, 7)

In [8]:
# DF row 개수
len(tips)

244

In [9]:
tips.shape[0]

244

In [10]:
#  DF column(변수) 이름
tips.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [11]:
tips.head( )     # tips_head(n=5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [12]:
# DF에서 마자막 3개 행
tips.iloc[-3:]

     total_bill   tip     sex smoker   day    time  size
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [13]:
tips.loc[(244 -3):]

     total_bill   tip     sex smoker   day    time  size
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [14]:
# 카테고리 타입 변수 요약 - 빈도수 (내림차순으로 출력)
# 성별 빈도수 
tips['sex'].value_counts()

Male      157
Female     87
Name: sex, dtype: int64

In [15]:
# 흡연여부 빈도수 
tips['smoker'].value_counts()

No     151
Yes     93
Name: smoker, dtype: int64

In [16]:
# 요일 빈도수 
tips['day'].value_counts()

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64

In [17]:
# 시간 빈도수
tips['time'].value_counts()

Dinner    176
Lunch      68
Name: time, dtype: int64

`value_counts` 메서드는 빈도수의 내림차순으로 정렬해서 결과를 리턴함.

In [18]:
# total_bill(영수증 금액) 최댓값인 행을 출력
tips[tips['total_bill'] == tips['total_bill'].max()]

     total_bill   tip   sex smoker  day    time  size
170       50.81  10.0  Male    Yes  Sat  Dinner     3

In [19]:
# total_bill(영수증 금액) 최솟값인 행을 출력
tips[tips['total_bill'] == tips['total_bill'].min()]

    total_bill  tip     sex smoker  day    time  size
67        3.07  1.0  Female    Yes  Sat  Dinner     1

In [20]:
# total_bill(영수증 금액) 최댓값이거나 최솟값인 행을 출력

In [21]:
# tips[ ( ) | ( ) ]
tips[(tips.total_bill == tips.total_bill.max()) | 
        (tips.total_bill == tips.total_bill.min()) ]

     total_bill   tip     sex smoker  day    time  size
67         3.07   1.0  Female    Yes  Sat  Dinner     1
170       50.81  10.0    Male    Yes  Sat  Dinner     3

토요일의 tip의 평균

In [22]:
df_sat = tips[tips['day'] == 'Sat']      # 데이터프레임에서 조건에 만족하는 row를 선택한 데이터프레임 
df_sat

     total_bill   tip     sex smoker  day    time  size
19        20.65  3.35    Male     No  Sat  Dinner     3
20        17.92  4.08    Male     No  Sat  Dinner     2
21        20.29  2.75  Female     No  Sat  Dinner     2
22        15.77  2.23  Female     No  Sat  Dinner     2
23        39.42  7.58    Male     No  Sat  Dinner     4
..          ...   ...     ...    ...  ...     ...   ...
238       35.83  4.67  Female     No  Sat  Dinner     3
239       29.03  5.92    Male     No  Sat  Dinner     3
240       27.18  2.00  Female    Yes  Sat  Dinner     2
241       22.67  2.00    Male    Yes  Sat  Dinner     2
242       17.82  1.75    Male     No  Sat  Dinner     2

[87 rows x 7 columns]

In [23]:
# 토요일 부분집합에서 tip컬럼의 평균 
df_sat['tip'].mean()

2.993103448275862

In [24]:
tips[tips['day'] == 'Sat']['tip'].mean()
# tips[tip.day == 'Sat'].tip.mean()

2.993103448275862

In [25]:
tips[tips['day'] == 'Sat'].mean().loc['tip']           # series에서 레이블을 찾는 것
#tips[tips['day'] == 'Sat'].mean().tip

2.993103448275862

성별 tip의 평균

In [26]:
# (1) 남성 tip
tips[tips['sex'] == 'Male'].tip.mean()

3.0896178343949052

In [27]:
# (2) 여성 tip
tips[tips['sex'] == 'Female'].tip.mean()

2.833448275862069

일요일 여성 손님의 tip평균

In [28]:
# tips[ ( ) & ( )]
tips[(tips['sex'] == 'Female')  &  (tips['day'] == 'Sun')].mean().tip

3.3672222222222223

일요일에 식사한 여성 비흡연자 손님들의 tip평균

In [29]:
tips[(tips['sex'] == 'Female')  &  (tips['day'] == 'Sun') & (tips['smoker'] == 'No')].mean().tip

3.329285714285714

In [30]:
titanic = sns.load_dataset('titanic')
titanic

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0           0       3    male  22.0  ...   NaN  Southampton     no  False
1           1       1  female  38.0  ...     C    Cherbourg    yes  False
2           1       3  female  26.0  ...   NaN  Southampton    yes   True
3           1       1  female  35.0  ...     C  Southampton    yes  False
4           0       3    male  35.0  ...   NaN  Southampton     no   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[891 rows x 15 columns]


titanic DF의 변수(컬럼):

* survived: 생존 여부(0: 사망, 1: 생존)
    *    alive 변수와 중복
*pclass: 승객 객실 등급
    *    class 변수와 중복
*sex: 성별
*age: 나이
*sibsp: 동승한 형제자매 또는 배우자 수
*parch: 동승한 부모 또는 자녀 수
*fare: 티켓 가격
*embarked: 정박지
    * embark_town 변수와 중복

* 생존자, 사망자 수

In [31]:
titanic['survived'].value_counts()

0    549
1    342
Name: survived, dtype: int64

In [32]:
live_num = len(titanic[(titanic['alive'] == 'yes')])
live_num

342

In [33]:
death_num = len(titanic[(titanic['alive'] == 'no')])
death_num

549

* 생존자 비율, 사망자 비율

In [34]:
# live_num / sum(titanic['survived'].value_counts())
# death_num / sum(titanic['survived'].value_counts())

num_passenegers = len(titanic)   # 전체 승객 수
ratio_alive = live_num / num_passenegers   #  생존비율
ratio_dead = death_num / num_passenegers # 사망 비율

print(ratio_alive, ratio_dead)

0.3838383838383838 0.6161616161616161

In [35]:
# series / 1      각 원소들을 하나씩 똑같은 숫자로 더하거나 나눔 
titanic['alive'].value_counts() / len(titanic)

no     0.616162
yes    0.383838
Name: alive, dtype: float64

* 남성 생존자 비율, 여성 생존자 비율 
    * 남성 생존자 비율 = (남성 생존자 수) / (남성 승객 수) 
    * 여성 생존자 비율 = (여성 생존자 수) / (여성 승객 수)

In [36]:
# 남성 생존자 수 
male_live = len(titanic[(titanic['sex'] == 'male')  &  (titanic['alive'] == 'yes')])
male_live

# 남성 승객 수 
male_num = len(titanic[(titanic['sex'] == 'male')])
male_num

577

In [37]:
male_live / male_num

0.18890814558058924

* 전체 승객 중 남성 생존자 비율, 여성 생존자 비율 
    * 남성 생존자 비율 = (남성 생존자 수) / (전체 승객 수) 
    * 여성 생존자 비율 = (여성 생존자 수) / (전체 승객 수)

* 객실 등급별 생존자 숫자, 비율
    * (1등급 객실 생존자 수) / (1등급 객실 승객 수) 
    * ...

In [38]:
titanic['pclass'].unique()

array([3, 1, 2])

 * 전체 승객 대비 객실 등급별 생존자 비율
    * (1등급 객실 생존자 수) / (전체 승객 수) 
    * ...